SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32G0005/MM32G0005_Bootloader/Device/MM32G0005/HAL_Lib/inc/hal_tim.h
/**
  * @brief TIM_Flags
  */
#define TIM_FLAG_Update                   (0x01U << TIM_SR_UIF_Pos)      /*!< TIM update Flag */
#define TIM_FLAG_CC1                      (0x01U << TIM_SR_CC1IF_Pos)    /*!< TIM Capture Compare 1 Flag */
#define TIM_FLAG_CC2                      (0x01U << TIM_SR_CC2IF_Pos)    /*!< TIM Capture Compare 2 Flag */
#define TIM_FLAG_CC3                      (0x01U << TIM_SR_CC3IF_Pos)    /*!< TIM Capture Compare 3 Flag */
#define TIM_FLAG_CC4                      (0x01U << TIM_SR_CC4IF_Pos)    /*!< TIM Capture Compare 4 Flag */
#define TIM_FLAG_COM                      (0x01U << TIM_SR_COMIF_Pos)    /*!< TIM Commutation Flag */
#define TIM_FLAG_Trigger                  (0x01U << TIM_SR_TIF_Pos)      /*!< TIM Trigger Flag */
#define TIM_FLAG_Break                    (0x01U << TIM_SR_BIF_Pos)      /*!< TIM Break Flag */
#define TIM_FLAG_CC1OF                    (0x01U << TIM_SR_CC1OF_Pos)    /*!< TIM Capture Compare 1 overcapture Flag */
#define TIM_FLAG_CC2OF                    (0x01U << TIM_SR_CC2OF_Pos)    /*!< TIM Capture Compare 2 overcapture Flag */
#define TIM_FLAG_CC3OF                    (0x01U << TIM_SR_CC3OF_Pos)    /*!< TIM Capture Compare 3 overcapture Flag */
#define TIM_FLAG_CC4OF                    (0x01U << TIM_SR_CC4OF_Pos)    /*!< TIM Capture Compare 4 overcapture Flag */
#define TIM_FLAG_CC5                      (0x01U << TIM_SR_CC5IF_Pos)    /*!< TIM Capture Compare 5 Flag */

/**
  * @brief PWM phase shift and DMA repeat update
  */
#define TIM_PDER_CCR1SHIFTEN               (0x01U << TIM_PDER_CCR1_SHIFT_EN_Pos)   /*!< TIM Channel 1 output PWM phase shift enable bit */
#define TIM_PDER_CCR2SHIFTEN               (0x01U << TIM_PDER_CCR2_SHIFT_EN_Pos)   /*!< TIM Channel 2 output PWM phase shift enable bit */
#define TIM_PDER_CCR3SHIFTEN               (0x01U << TIM_PDER_CCR3_SHIFT_EN_Pos)   /*!< TIM Channel 3 output PWM phase shift enable bit */
#define TIM_PDER_CCR4SHIFTEN               (0x01U << TIM_PDER_CCR4_SHIFT_EN_Pos)   /*!< TIM Channel 4 output PWM phase shift enable bit */
#define TIM_PDER_CCR5SHIFTEN               (0x01U << TIM_PDER_CCR5_SHIFT_EN_Pos)   /*!< TIM Channel 5 output PWM phase shift enable bit */

/**
  * @brief Break input filter
  */
#define TIM_BKINF_2                        (0x00U << TIM_BKINF_BKINF_Pos)        /*!< 2 cycles */
#define TIM_BKINF_4                        (0x01U << TIM_BKINF_BKINF_Pos)        /*!< 4 cycles */
#define TIM_BKINF_8                        (0x02U << TIM_BKINF_BKINF_Pos)        /*!< 8 cycles */
#define TIM_BKINF_16                       (0x03U << TIM_BKINF_BKINF_Pos)        /*!< 16 cycles */
#define TIM_BKINF_32                       (0x04U << TIM_BKINF_BKINF_Pos)        /*!< 32 cycles */
#define TIM_BKINF_64                       (0x05U << TIM_BKINF_BKINF_Pos)        /*!< 64 cycles */
#define TIM_BKINF_128                      (0x06U << TIM_BKINF_BKINF_Pos)        /*!< 128 cycles */
#define TIM_BKINF_256                      (0x07U << TIM_BKINF_BKINF_Pos)        /*!< 256 cycles */
#define TIM_BKINF_384                      (0x08U << TIM_BKINF_BKINF_Pos)        /*!< 384 cycles */
#define TIM_BKINF_512                      (0x09U << TIM_BKINF_BKINF_Pos)        /*!< 512 cycles */
#define TIM_BKINF_640                      (0x0AU << TIM_BKINF_BKINF_Pos)        /*!< 640 cycles */
#define TIM_BKINF_768                      (0x0BU << TIM_BKINF_BKINF_Pos)        /*!< 768 cycles */
#define TIM_BKINF_896                      (0x0CU << TIM_BKINF_BKINF_Pos)        /*!< 896 cycles */
#define TIM_BKINF_1024                     (0x0DU << TIM_BKINF_BKINF_Pos)        /*!< 1024 cycles */
#define TIM_BKINF_1152                     (0x0EU << TIM_BKINF_BKINF_Pos)        /*!< 1152 cycles */
#define TIM_BKINF_1280                     (0x0FU << TIM_BKINF_BKINF_Pos)        /*!< 1280 cycles */

/**
  * @brief IO break input sel
  */
#define TIM_IOBKIN_BKIN1                   (0x01U << TIM_BKINF_IOBKIN_SEL_Pos) /*!< TIM1_BKIN1 break input sel */

/**
  * @brief COMP break input sel
  */
#define TIM_COMPBKIN_COMP1                 (0x01U << TIM_BKINF_COMPBKIN_SEL_Pos) /*!< COMP1_OUT break input sel */

/**
  * @brief TIM ETR remap sel
  */
#define TIM_ETR_RMP_LSIInput              (0x01U << TIM_OR_ETR_RMP_Pos)         /*!< LSI input */
#define TIM_ETR_RMP_HSEDiv128Input        (0x03U << TIM_OR_ETR_RMP_Pos)         /*!< HSE Div128 input */

/**
  * @brief TIM TI4 remap sel
  */
#define TIM_TI4_RMP_GPIOInput             (0x00U << TIM_OR_TI4_RMP_Pos)         /*!< CH4 GPIO input */
#define TIM_TI4_RMP_LSIInput              (0x01U << TIM_OR_TI4_RMP_Pos)         /*!< LSI clock input */
#define TIM_TI4_RMP_HSEDiv128Input        (0x03U << TIM_OR_TI4_RMP_Pos)         /*!< HSE Div128 input */

/**
  * @brief TIM output compare clear select
  */  
#define TIM_OCRefClear_ExtTrigger           (0x00U << TIM_SMCR_OCCS_Pos)   /*!< External trigger signal */
#define TIM_OCRefClear_COMPOutput           (0x01U << TIM_SMCR_OCCS_Pos)   /*!< COMP output signal */

/**
  * @brief TIM debug output mode
  */  
#define TIM_DebugOutput_Hold          (0x00U << TIM_DOCR_DOS_Pos)   /*!< OCx/OCxN maintains the output value before entering the debug mode */
#define TIM_DebugOutput_Low           (0x01U << TIM_DOCR_DOS_Pos)   /*!< OCx/OCxN output low level */
#define TIM_DebugOutput_Opposite      (0x02U << TIM_DOCR_DOS_Pos)   /*!< OCx output high level, OCxN output low level. */
#define TIM_DebugOutput_BreakSet      (0x03U << TIM_DOCR_DOS_Pos)   /*!< OCx/OCxN output the level set by the brake function. */

/**
  * @brief TIM soft output channel
  */
#define TIM_SoftChannel_OC1     0x01   /*!< OC1  as the software output channel */
#define TIM_SoftChannel_OC1N    0x02   /*!< OC1N as the software output channel */
#define TIM_SoftChannel_OC2     0x04   /*!< OC2  as the software output channel */
#define TIM_SoftChannel_OC2N    0x08   /*!< OC2N as the software output channel */
#define TIM_SoftChannel_OC3     0x10   /*!< OC3  as the software output channel */
#define TIM_SoftChannel_OC3N    0x20   /*!< OC3N as the software output channel */
#define TIM_SoftChannel_OC4     0x40   /*!< OC4  as the software output channel */
#define TIM_SoftChannel_OC4N    0x80   /*!< OC4N as the software output channel */

/**
  * @brief TIM soft output value
  */
#define TIM_SoftOutput_Low      0x00    /*!< OCx/OCxN software set output 0 */
#define TIM_SoftOutput_High     0x01    /*!< OCx/OCxN Software set output 1 */

/**
  * @brief TIM Break Flags
  */
#define TIM_BreakFlag_CMP              (0x01U << TIM_BKSR_BCPTF0_Pos) /*!< TIM CMP Break Flag */
#define TIM_BreakFlag_IO               (0x01U << TIM_BKSR_BIOF_Pos)   /*!< TIM IO Break Flag   */

/**
  * @}
  */

/** @defgroup TIM_Exported_Functions
  * @{
  */
void TIM_DeInit(TIM_TypeDef *tim);

void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef *init_struct);
void TIM_TimeBaseInit(TIM_TypeDef *tim, TIM_TimeBaseInitTypeDef *init_struct);

